Revit 2027 API
Alignment.GUID Property
 The GUID of this alignment.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GUID { get; }
Public ReadOnly Property GUID As Guid
	Get
public:
property Guid GUID {
	Guid get ();
}
member GUID : Guid with get
Property Value
Guid
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace